#+title: Querying practice with SQLite
#+author: Marcus Birkenkrahe (pledged)
#+STARTUP: overview hideblocks indent :
#+options: toc:nil num:nil
* README

- Enter your name at the top followed by ~(pledged)~
- When you're done, upload the finished file to Canvas.
- Download ~books.sql~ from ~tinyurl.com/books-sql~
- Download this file from ~tinyurl.com/querying-practice~
- Solution (PDF) on GitHub.

* Problems

1) Correct the SQL command for style:
   #+begin_example sql
   select AUTHORS, TITLE from BOOKS
   #+end_example
   Better:
   #+begin_example sql
   SELECT author, title FROM books;
   #+end_example

2) Read ~books.sql~ into ~books.sqlite :exports both~ database, then show
   the table (if the ~books~ table is already there, delete it first):
   #+begin_src sqlite :db books.sqlite :exports both
     DROP TABLE IF EXISTS books;
     .read Books.sql
     .tables
   #+end_src

   #+RESULTS:
   : books

3) Check the data types and fields (columns) in the table:
   #+begin_src sqlite :db books.sqlite :exports both :results output
	.schema
   #+end_src

   #+RESULTS:
   : CREATE TABLE books (
   :        id INT,
   :        title TEXT,
   :        author TEXT,
   :        year INT,
   :        genre TEXT);

4) Select all titles from ~books~.
   #+begin_src sqlite :db books.sqlite :exports both :results output
	SELECT title FROM books;
   #+end_src

   #+RESULTS:

5) Is SQLite case-sensitive? Use ~TITLE~ instead of ~title~ in the
   query. (For the print version, limit this to 20 lines.)
   #+begin_src sqlite :db books.sqlite :exports both :results output
	SELECT TITLE FROM books LIMIT 20;
   #+end_src

   #+RESULTS:
   #+begin_example
   "10-Day Green Smoothie Cleanse"
   "11/22/63: A Novel"
   "12 Rules for Life: An Antidote to Chaos"
   "1984 (Signet Classics)"
   """5,000 Awesome Facts (About Everything!) (National Geographic Kids)"""
   "A Dance with Dragons (A Song of Ice and Fire)"
   "A Game of Thrones / A Clash of Kings / A Storm of Swords / A Feast of Crows / A Dance with Dragons"
   "A Gentleman in Moscow: A Novel"
   """A Higher Loyalty: Truth, Lies, and Leadership"""
   "A Man Called Ove: A Novel"
   "A Patriot's History of the United States: From Columbus's Great Discovery to the War on Terror"
   "A Stolen Life: A Memoir"
   "A Wrinkle in Time (Time Quintet)"
   """Act Like a Lady, Think Like a Man: What Men Really Think About Love, Relationships, Intimacy, and Commitment"""
   """Adult Coloring Book Designs: Stress Relief Coloring Book: Garden Designs, Mandalas, Animals, and Paisley Patterns"""
   "Adult Coloring Book: Stress Relieving Animal Designs"
   "Adult Coloring Book: Stress Relieving Patterns"
   """Adult Coloring Books: A Coloring Book for Adults Featuring Mandalas and Henna Inspired Flowers, Animals, and Paisley…"""
   "Alexander Hamilton"
   "All the Light We Cannot See"
   Allegiant
   "American Sniper: The Autobiography of the Most Lethal Sniper in U.S. Military History"
   "And the Mountains Echoed"
   "Arguing with Idiots: How to Stop Small Minds and Big Government"
   "Astrophysics for People in a Hurry"
   """Autobiography of Mark Twain, Vol. 1"""
   "Baby Touch and Feel: Animals"
   "Balance (Angie's Extreme Stress Menders)"
   "Barefoot Contessa Foolproof: Recipes You Can Trust: A Cookbook"
   """Barefoot Contessa, How Easy Is That?: Fabulous Recipes & Easy Tips"""
   Becoming
   "Being Mortal: Medicine and What Matters in the End"
   "Between the World and Me"
   "Born to Run"
   """Breaking Dawn (The Twilight Saga, Book 4)"""
   """Broke: The Plan to Restore Our Trust, Truth and Treasure"""
   """Brown Bear, Brown Bear, What Do You See?"""
   """Cabin Fever (Diary of a Wimpy Kid, Book 6)"""
   "Calm the F*ck Down: An Irreverent Adult Coloring Book (Irreverent Book Series)"
   "Can't Hurt Me: Master Your Mind and Defy the Odds"
   "Capital in the Twenty First Century"
   "Catching Fire (The Hunger Games)"
   "Cravings: Recipes for All the Food You Want to Eat: A Cookbook"
   "Crazy Love: Overwhelmed by a Relentless God"
   "Crazy Rich Asians (Crazy Rich Asians Trilogy)"
   "Creative Haven Creative Cats Coloring Book (Adult Coloring)"
   "Creative Haven Owls Coloring Book (Adult Coloring)"
   "Cutting for Stone"
   """Daring Greatly: How the Courage to Be Vulnerable Transforms the Way We Live, Love, Parent, and Lead"""
   """David and Goliath: Underdogs, Misfits, and the Art of Battling Giants"""
   "Dead And Gone: A Sookie Stackhouse Novel (Sookie Stackhouse/True Blood)"
   """Dead in the Family (Sookie Stackhouse/True Blood, Book 10)"""
   """Dead Reckoning (Sookie Stackhouse/True Blood, Book 11)"""
   "Dear Zoo: A Lift-the-Flap Book"
   "Decision Points"
   """Delivering Happiness: A Path to Profits, Passion, and Purpose"""
   """Diagnostic and Statistical Manual of Mental Disorders, 5th Edition: DSM-5"""
   """Diary of a Wimpy Kid: Hard Luck, Book 8"""
   "Diary of a Wimpy Kid: The Last Straw (Book 3)"
   "Diary of a Wimpy Kid: The Long Haul"
   "Difficult Riddles For Smart Kids: 300 Difficult Riddles And Brain Teasers Families Will Love (Books for Smart Kids)"
   Divergent
   "Divergent / Insurgent"
   """Divine Soul Mind Body Healing and Transmission System: The Divine Way to Heal You, Humanity, Mother Earth, and All…"""
   "Doctor Sleep: A Novel"
   """Dog Days (Diary of a Wimpy Kid, Book 4) (Volume 4)"""
   "Dog Man and Cat Kid: From the Creator of Captain Underpants (Dog Man #4)"
   "Dog Man: A Tale of Two Kitties: From the Creator of Captain Underpants (Dog Man #3)"
   "Dog Man: Brawl of the Wild: From the Creator of Captain Underpants (Dog Man #6)"
   "Dog Man: Fetch-22: From the Creator of Captain Underpants (Dog Man #8)"
   "Dog Man: For Whom the Ball Rolls: From the Creator of Captain Underpants (Dog Man #7)"
   "Dog Man: Lord of the Fleas: From the Creator of Captain Underpants (Dog Man #5)"
   "Double Down (Diary of a Wimpy Kid #11)"
   "Dover Creative Haven Art Nouveau Animal Designs Coloring Book (Creative Haven Coloring Books)"
   "Drive: The Surprising Truth About What Motivates Us"
   "Eat This Not That! Supermarket Survival Guide: The No-Diet Weight Loss Solution"
   """Eat This, Not That! Thousands of Simple Food Swaps that Can Save You 10, 20, 30 Pounds--or More!"""
   """Eat to Live: The Amazing Nutrient-Rich Program for Fast and Sustained Weight Loss, Revised Edition"""
   "Eclipse (Twilight Sagas)"
   "Eclipse (Twilight)"
   "Educated: A Memoir"
   """Enchanted Forest: An Inky Quest and Coloring book (Activity Books, Mindfulness and Meditation, Illustrated Floral Prints…"""
   "Fahrenheit 451"
   "Fantastic Beasts and Where to Find Them: The Original Screenplay (Harry Potter)"
   "Fear: Trump in the White House"
   "Fifty Shades Darker"
   "Fifty Shades Freed: Book Three of the Fifty Shades Trilogy (Fifty Shades of Grey Series) (English Edition)"
   "Fifty Shades of Grey: Book One of the Fifty Shades Trilogy (Fifty Shades of Grey Series)"
   "Fifty Shades Trilogy (Fifty Shades of Grey / Fifty Shades Darker / Fifty Shades Freed)"
   "Fire and Fury: Inside the Trump White House"
   "First 100 Words"
   "Food Rules: An Eater's Manual"
   "Frozen (Little Golden Book)"
   """Game Change: Obama and the Clintons, McCain and Palin, and the Race of a Lifetime"""
   "Game of Thrones Boxed Set: A Game of Thrones/A Clash of Kings/A Storm of Swords/A Feast for Crows"
   "George Washington's Sacred Fire"
   "George Washington's Secret Six: The Spy Ring That Saved the American Revolution"
   "Giraffes Can't Dance"
   """Girl, Stop Apologizing: A Shame-Free Plan for Embracing and Achieving Your Goals"""
   """Girl, Wash Your Face: Stop Believing the Lies About Who You Are So You Can Become Who You Were Meant to Be"""
   """Glenn Beck's Common Sense: The Case Against an Out-of-Control Government, Inspired by Thomas Paine"""
   "Go Set a Watchman: A Novel"
   "Go the F**k to Sleep"
   "Going Rogue: An American Life"
   "Gone Girl"
   "Good Days Start With Gratitude: A 52 Week Guide To Cultivate An Attitude Of Gratitude: Gratitude Journal"
   "Good to Great: Why Some Companies Make the Leap and Others Don't"
   "Goodnight Moon"
   """Goodnight, Goodnight Construction Site (Hardcover Books for Toddlers, Preschool Books for Kids)"""
   """Grain Brain: The Surprising Truth about Wheat, Carbs, and Sugar--Your Brain's Silent Killers"""
   "Grey: Fifty Shades of Grey as Told by Christian (Fifty Shades of Grey Series)"
   Guts
   "Hamilton: The Revolution"
   """Happy, Happy, Happy: My Life and Legacy as the Duck Commander"""
   """Harry Potter and the Chamber of Secrets: The Illustrated Edition (Harry Potter, Book 2)"""
   """Harry Potter and the Cursed Child, Parts 1 & 2, Special Rehearsal Edition Script"""
   """Harry Potter and the Goblet of Fire: The Illustrated Edition (Harry Potter, Book 4) (4)"""
   """Harry Potter and the Prisoner of Azkaban: The Illustrated Edition (Harry Potter, Book 3)"""
   """Harry Potter and the Sorcerer's Stone: The Illustrated Edition (Harry Potter, Book 1)"""
   "Harry Potter Coloring Book"
   "Harry Potter Paperback Box Set (Books 1-7)"
   "Have a Little Faith: A True Story"
   "Heaven is for Real: A Little Boy's Astounding Story of His Trip to Heaven and Back"
   "Hillbilly Elegy: A Memoir of a Family and Culture in Crisis"
   "Homebody: A Guide to Creating Spaces You Never Want to Leave"
   "How to Win Friends & Influence People"
   "Howard Stern Comes Again"
   "Humans of New York"
   "Humans of New York : Stories"
   """Hyperbole and a Half: Unfortunate Situations, Flawed Coping Mechanisms, Mayhem, and Other Things That Happened"""
   """I Am Confident, Brave & Beautiful: A Coloring Book for Girls"""
   """I, Alex Cross"""
   "If Animals Kissed Good Night"
   "If I Stay"
   """In the Garden of Beasts: Love, Terror, and an American Family in Hitler's Berlin"""
   Inferno
   "Inheritance: Book IV (Inheritance Cycle)"
   "Instant Pot Pressure Cooker Cookbook: 500 Everyday Recipes for Beginners and Advanced Users. Try Easy and Healthy…"
   "It's Not Supposed to Be This Way: Finding Unexpected Strength When Disappointments Leave You Shattered"
   "Jesus Calling: Enjoying Peace in His Presence (with Scripture References)"
   "JOURNEY TO THE ICE P"
   "Joyland (Hard Case Crime)"
   "Killers of the Flower Moon: The Osage Murders and the Birth of the FBI"
   "Killing Jesus (Bill O'Reilly's Killing Series)"
   "Killing Kennedy: The End of Camelot"
   "Killing Lincoln: The Shocking Assassination that Changed America Forever (Bill O'Reilly's Killing Series)"
   "Killing Patton: The Strange Death of World War II's Most Audacious General (Bill O'Reilly's Killing Series)"
   "Killing Reagan: The Violent Assault That Changed a Presidency (Bill O'Reilly's Killing Series)"
   "Killing the Rising Sun: How America Vanquished World War II Japan (Bill O'Reilly's Killing Series)"
   "Kitchen Confidential Updated Edition: Adventures in the Culinary Underbelly (P.S.)"
   "Knock-Knock Jokes for Kids"
   """Last Week Tonight with John Oliver Presents A Day in the Life of Marlon Bundo (Better Bundo Book, LGBT Childrens Book)"""
   "Laugh-Out-Loud Jokes for Kids"
   """Lean In: Women, Work, and the Will to Lead"""
   "Leonardo da Vinci"
   "Lettering and Modern Calligraphy: A Beginner's Guide: Learn Hand Lettering and Brush Lettering"
   "Liberty and Tyranny: A Conservative Manifesto"
   Life
   "Little Bee: A Novel"
   "Little Blue Truck"
   "Little Fires Everywhere"
   "Looking for Alaska"
   """Love Wins: A Book About Heaven, Hell, and the Fate of Every Person Who Ever Lived"""
   "Love You Forever"
   "Magnolia Table: A Collection of Recipes for Gathering"
   "Make It Ahead: A Barefoot Contessa Cookbook"
   "Make Your Bed: Little Things That Can Change Your Life...And Maybe the World"
   """Mastering the Art of French Cooking, Vol. 2"""
   "Milk and Honey"
   "Milk and Vine: Inspirational Quotes From Classic Vines"
   "Mindset: The New Psychology of Success"
   "Mockingjay (The Hunger Games)"
   """National Geographic Kids Why?: Over 1,111 Answers to Everything"""
   "National Geographic Little Kids First Big Book of Why (National Geographic Little Kids First Big Books)"
   "New Moon (The Twilight Saga)"
   "Night (Night)"
   "No Easy Day: The Autobiography of a Navy Seal: The Firsthand Account of the Mission That Killed Osama Bin Laden"
   "Obama: An Intimate Portrait"
   """Oh, the Places You'll Go!"""
   "Old School (Diary of a Wimpy Kid #10)"
   "Olive Kitteridge"
   "One Thousand Gifts: A Dare to Live Fully Right Where You Are"
   """Option B: Facing Adversity, Building Resilience, and Finding Joy"""
   "Origin: A Novel (Robert Langdon)"
   "Orphan Train"
   "Outliers: The Story of Success"
   "P is for Potty! (Sesame Street) (Lift-the-Flap)"
   "Percy Jackson and the Olympians Paperback Boxed Set (Books 1-3)"
   "Player's Handbook (Dungeons & Dragons)"
   "Pokémon Deluxe Essential Handbook: The Need-to-Know Stats and Facts on Over 700 Pokémon"
   "Proof of Heaven: A Neurosurgeon's Journey into the Afterlife"
   """Publication Manual of the American Psychological Association, 6th Edition"""
   "Puppy Birthday to You! (Paw Patrol) (Little Golden Book)"
   "Quiet: The Power of Introverts in a World That Can't Stop Talking"
   "Radical: Taking Back Your Faith from the American Dream"
   "Ready Player One: A Novel"
   "Rush Revere and the Brave Pilgrims: Time-Travel Adventures with Exceptional Americans (1)"
   "Rush Revere and the First Patriots: Time-Travel Adventures With Exceptional Americans (2)"
   """Salt, Fat, Acid, Heat: Mastering the Elements of Good Cooking"""
   "Sarah's Key"
   """School Zone - Big Preschool Workbook - Ages 4 and Up, Colors, Shapes, Numbers 1-10, Alphabet, Pre-Writing, Pre-Reading…"""
   """Secret Garden: An Inky Treasure Hunt and Coloring Book (For Adults, mindfulness coloring)"""
   "Sh*t My Dad Says"
   "Ship of Fools: How a Selfish Ruling Class Is Bringing America to the Brink of Revolution"
   "Shred: The Revolutionary Diet: 6 Weeks 4 Inches 2 Sizes"
   "Sookie Stackhouse"
   """Soul Healing Miracles: Ancient and New Sacred Wisdom, Knowledge, and Practical Techniques for Healing the Spiritual…"""
   "Steve Jobs"
   "Strange Planet (Strange Planet Series)"
   "StrengthsFinder 2.0"
   """Super Freakonomics: Global Cooling, Patriotic Prostitutes, and Why Suicide Bombers Should Buy Life Insurance"""
   "Switch: How to Change Things When Change Is Hard"
   "Sycamore Row (Jake Brigance)"
   "Teach Like a Champion: 49 Techniques that Put Students on the Path to College"
   "The 17 Day Diet: A Doctor's Plan Designed for Rapid Results"
   """The 4 Hour Body: An Uncommon Guide to Rapid Fat Loss, Incredible Sex and Becoming Superhuman"""
   "The 5 Love Languages: The Secret to Love That Lasts"
   "The 5 Love Languages: The Secret to Love that Lasts"
   "The 5000 Year Leap"
   "The 7 Habits of Highly Effective People: Powerful Lessons in Personal Change"
   "The Alchemist"
   "The Amateur"
   "The Art of Racing in the Rain: A Novel"
   "The Big Short: Inside the Doomsday Machine"
   "The Blood of Olympus (The Heroes of Olympus (5))"
   """The Blood Sugar Solution: The UltraHealthy Program for Losing Weight, Preventing Disease, and Feeling Great Now!"""
   """The Body Keeps the Score: Brain, Mind, and Body in the Healing of Trauma"""
   "The Book of Basketball: The NBA According to The Sports Guy"
   "The Book Thief"
   "The Book with No Pictures"
   "The Boys in the Boat: Nine Americans and Their Epic Quest for Gold at the 1936 Berlin Olympics"
   "The Casual Vacancy"
   "The China Study: The Most Comprehensive Study of Nutrition Ever Conducted And the Startling Implications for Diet…"
   "The Complete Ketogenic Diet for Beginners: Your Essential Guide to Living the Keto Lifestyle"
   "The Confession: A Novel"
   "The Constitution of the United States"
   2016
   "The Daily Show with Jon Stewart Presents Earth (The Book): A Visitor's Guide to the Human Race"
   "The Day the Crayons Quit"
   """The Dukan Diet: 2 Steps to Lose the Weight, 2 Steps to Keep It Off Forever"""
   "The Elegance of the Hedgehog"
   "The Fault in Our Stars"
   "The Five Dysfunctions of a Team: A Leadership Fable"
   "The Five Love Languages: How to Express Heartfelt Commitment to Your Mate"
   "The Four Agreements: A Practical Guide to Personal Freedom (A Toltec Wisdom Book)"
   "The Getaway"
   "The Girl on the Train"
   "The Girl Who Kicked the Hornet's Nest (Millennium Trilogy)"
   "The Girl Who Played with Fire (Millennium Series)"
   "The Girl Who Played with Fire (Millennium)"
   "The Girl with the Dragon Tattoo (Millennium Series)"
   "The Going-To-Bed Book"
   "The Goldfinch: A Novel (Pulitzer Prize for Fiction)"
   "The Great Gatsby"
   "The Guardians: A Novel"
   "The Guernsey Literary and Potato Peel Pie Society"
   "The Handmaid's Tale"
   "The Harbinger: The Ancient Mystery that Holds the Secret of America's Future"
   "The Hate U Give"
   "The Help"
   """The House of Hades (Heroes of Olympus, Book 4)"""
   "The Hunger Games"
   "The Hunger Games (Book 1)"
   "The Hunger Games Trilogy Boxed Set (1)"
   "The Immortal Life of Henrietta Lacks"
   "The Instant Pot Electric Pressure Cooker Cookbook: Easy Recipes for Fast & Healthy Meals"
   "The Last Lecture"
   """The Last Olympian (Percy Jackson and the Olympians, Book 5)"""
   "The Legend of Zelda: Hyrule Historia"
   "The Lego Ideas Book: Unlock Your Imagination"
   "The Life-Changing Magic of Tidying Up: The Japanese Art of Decluttering and Organizing"
   "The Litigators"
   """The Lost Hero (Heroes of Olympus, Book 1)"""
   "The Lost Symbol"
   "The Love Dare"
   "The Magnolia Story"
   """The Mark of Athena (Heroes of Olympus, Book 3)"""
   "The Martian"
   "The Maze Runner (Book 1)"
   "The Meltdown (Diary of a Wimpy Kid Book 13)"
   "The Mueller Report"
   "The Nightingale: A Novel"
   "The Official SAT Study Guide"
   """The Official SAT Study Guide, 2016 Edition (Official Study Guide for the New Sat)"""
   "The Paris Wife: A Novel"
   """The Pioneer Woman Cooks: A Year of Holidays: 140 Step-by-Step Recipes for Simple, Scrumptious Celebrations"""
   """The Pioneer Woman Cooks: Dinnertime - Comfort Classics, Freezer Food, 16-minute Meals, and Other Delicious Ways to Solve…"""
   "The Pioneer Woman Cooks: Food from My Frontier"
   """The Plant Paradox Cookbook: 100 Delicious Recipes to Help You Lose Weight, Heal Your Gut, and Live Lectin-Free"""
   "The Plant Paradox: The Hidden Dangers in ""Healthy"" Foods That Cause Disease and Weight Gain"
   "The Pout-Pout Fish"
   "The Power of Habit: Why We Do What We Do in Life and Business"
   "The President Is Missing: A Novel"
   "The Racketeer"
   """The Red Pyramid (The Kane Chronicles, Book 1)"""
   """The Road to Serfdom: Text and Documents--The Definitive Edition (The Collected Works of F. A. Hayek, Volume 2)"""
   """The Serpent's Shadow (The Kane Chronicles, Book 3)"""
   "The Shack: Where Tragedy Confronts Eternity"
   "The Short Second Life of Bree Tanner: An Eclipse Novella (The Twilight Saga)"
   "The Silent Patient"
   """The Son of Neptune (Heroes of Olympus, Book 2)"""
   "The Subtle Art of Not Giving a F*ck: A Counterintuitive Approach to Living a Good Life"
   "The Sun and Her Flowers"
   """The Third Wheel (Diary of a Wimpy Kid, Book 7)"""
   """The Throne of Fire (The Kane Chronicles, Book 2)"""
   "The Time Traveler's Wife"
   "The Tipping Point: How Little Things Can Make a Big Difference"
   "The Total Money Makeover: Classic Edition: A Proven Plan for Financial Fitness"
   "The Twilight Saga Collection"
   """The Ugly Truth (Diary of a Wimpy Kid, Book 5)"""
   "The Unofficial Harry Potter Cookbook: From Cauldron Cakes to Knickerbocker Glory--More Than 150 Magical Recipes for…"
   "The Very Hungry Caterpillar"
   "The Whole30: The 30-Day Guide to Total Health and Food Freedom"
   "The Wonderful Things You Will Be"
   "The Wonky Donkey"
   "The Wright Brothers"
   """Things That Matter: Three Decades of Passions, Pastimes and Politics [Deckled Edge]"""
   """Thinking, Fast and Slow"""
   "Thirteen Reasons Why"
   "Thomas Jefferson: The Art of Power"
   "Three Cups of Tea: One Man's Mission to Promote Peace - One School at a Time"
   "Thug Kitchen: The Official Cookbook: Eat Like You Give a F*ck (Thug Kitchen Cookbooks)"
   "Tina Fey: Bossypants"
   "To Kill a Mockingbird"
   """Tools of Titans: The Tactics, Routines, and Habits of Billionaires, Icons, and World-Class Performers"""
   """Towers of Midnight (Wheel of Time, Book Thirteen)"""
   "True Compass: A Memoir"
   """Twilight (The Twilight Saga, Book 1)"""
   "Ultimate Sticker Book: Frozen: More Than 60 Reusable Full-Color Stickers"
   """Unbroken: A World War II Story of Survival, Resilience, and Redemption"""
   "Under the Dome: A Novel"
   "Unfreedom of the Press"
   "Unicorn Coloring Book: For Kids Ages 4-8 (US Edition) (Silly Bear Coloring Books)"
   """Uninvited: Living Loved When You Feel Less Than, Left Out, and Lonely"""
   Watchmen
   "Water for Elephants: A Novel"
   "What Happened"
   "What If?: Serious Scientific Answers to Absurd Hypothetical Questions"
   "What Pet Should I Get? (Classic Seuss)"
   "What Should Danny Do? (The Power to Choose Series)"
   "What to Expect When You're Expecting"
   """Wheat Belly: Lose the Wheat, Lose the Weight, and Find Your Path Back to Health"""
   "When Breath Becomes Air"
   "Where the Crawdads Sing"
   "Where the Wild Things Are"
   "Whose Boat Is This Boat?: Comments That Don't Help in the Aftermath of a Hurricane"
   2018
   "Wild: From Lost to Found on the Pacific Crest Trail"
   "Winter of the World: Book Two of the Century Trilogy"
   "Women Food and God: An Unexpected Path to Almost Everything"
   Wonder
   "Wrecking Ball (Diary of a Wimpy Kid Book 14)"
   #+end_example
   
6) What about other SQL flavours?
   #+begin_notes
   - SQLite ist case-insensitive to table and field names
   - Other flavors are sometimes sensitive and sometimes not
   - Maintain common coding standards   
   #+end_notes

7) Select all fields from the ~books~ table:
   #+begin_src sqlite :db books.sqlite :exports both :results output
	SELECT * FROM books LIMIT 5;
   #+end_src

   #+RESULTS:
   : 1,"10-Day Green Smoothie Cleanse","JJ Smith",2016,"Non Fiction"
   : 2,"11/22/63: A Novel","Stephen King",2011,Fiction
   : 3,"12 Rules for Life: An Antidote to Chaos","Jordan B. Peterson",2018,"Non Fiction"
   : 4,"1984 (Signet Classics)","George Orwell",2017,Fiction
   : 5,"""5,000 Awesome Facts (About Everything!) (National Geographic Kids)""","National Geographic Kids",2019,"Non Fiction"

8) Display only the first five author records as "Writer".
   #+begin_src sqlite :db books.sqlite :exports both :results output
     .header on
     .mode column
     SELECT author AS "Writer" FROM books LIMIT 5;
   #+end_src

   #+RESULTS:
   : Writer                  
   : ------------------------
   : JJ Smith                
   : Stephen King            
   : Jordan B. Peterson      
   : George Orwell           
   : National Geographic Kids

9) The =COUNT()= function counts the number of records for a field. 
   #+begin_src sqlite :db books.sqlite :exports both :results output
	SELECT COUNT(id) FROM books;
   #+end_src

   #+RESULTS:
   : 352
   
10) How can you find out how many unique authors there are?
    #+begin_src sqlite :db books.sqlite :exports both :results output
	SELECT COUNT(DISTINCT author) FROM books;
    #+end_src

    #+RESULTS:
    : 248

11) When using ~DISTINCT~ with multiple fields, do the fields that are not
    labelled ~DISTINCT~ have repeat values or not? What about the records?
    #+begin_notes
    Yes, they do. Only the fields to which ~DISTINCT~ is applied are
    unique. As a result, the individual records are unique.
    #+end_notes

12) How many authors have written books in multiple genres?
    #+begin_src sqlite :db books.sqlite :exports both :results output
      SELECT COUNT(DISTINCT author) FROM books;
      -- count unique authors in more than one genre
      SELECT COUNT(*) FROM
       (SELECT DISTINCT author, genre FROM books);
    #+end_src

    #+RESULTS:
    : 248
    : 250

13) Create a view of unique authors, ~unique_authors~, then show the
    tables.
    #+begin_src sqlite :db books.sqlite :exports both :results output
      CREATE VIEW unique_authors AS -- stored query
       SELECT DISTINCT author FROM books; -- all unique authors
      .tables
    #+end_src

    #+RESULTS:
    : books           unique_authors

    Note that ~.tables~ shows physical as well as virtual tables (like
    ~VIEWS~). The difference is that virtual tables are read-only by
    default, and they do not store data physically (in RAM) but
    rather, they generate (query) data dynamically at runtime using
    the specified ~SELECT~ query.

14) Now display the first five records of ~unique_authors~ and name the
    column `unique author`.
    #+begin_src sqlite :db books.sqlite :exports both :results output
      -- use columns names for the header	
      -- switch from CSV to column format	
      .header ON     
      .mode column   
      SELECT author as 'unique author'  -- column to be selected
        FROM unique_authors   -- table aka view to be used
             LIMIT 5;  -- number of lines to be displayed
    #+end_src

    #+RESULTS:
    : unique author           
    : ------------------------
    : JJ Smith                
    : Stephen King            
    : Jordan B. Peterson      
    : George Orwell           
    : National Geographic Kids

15) Does ~unique_authors~ need a unique identifier? (Like an ~id~ column.)
    #+begin_notes
    No, since every record is already unique by design (=DISTINCT=) but
    if you wanted to use the ~VIEW~ as a table you have to add a ~PRIMARY
    KEY~ (preferably a number, though text is allowed in SQLite) to
    join tables.
    #+end_notes

